#ifndef __DAC_H
#define __DAC_H	 
#include "common.h"	     			    
 	

void DAC1_Init(void);		//DAC通道1初始化	 	
/****************************************************************************
* 名    称: void Dac1_Set_Vol(u16 vol)
* 功    能：设置通道1输出电压
* 入口参数：vol:0~3300,代表0~3.3V  0~4095
* 返回参数：无
* 说    明：       
****************************************************************************/
void Dac1_Set_Vol(u16 vol);	//设置通道1输出电压

//DAC通道2输出初始化
void DAC2_Init(void);
/****************************************************************************
* 名    称: void Dac2_Set_Vol_5V(u16 vol)
* 功    能：设置通道2输出电压
* 入口参数：vol:0~5000,代表0~5V
* 返回参数：无
* 说    明：       
****************************************************************************/
void Dac2_Set_Vol_5V(u16 vol);

/****************************************************************************
* 名    称: void Dac2_Set_Vol_3d3V(u16 vol)
* 功    能：设置通道1输出电压
* 入口参数：vol:0~3300,代表0~3.3V
* 返回参数：无
* 说    明：       
****************************************************************************/
void Dac2_Set_Vol_3d3V(u16 vol);

#endif

















